Tekla.Structures.Drawing.UI.Events
The Events class allows the user to register event listeners for drawing user interface events.
Remarks:
Asynchronous event handling
Registered event handlers are called asynchronously so that many handlers may be running
simultaneously. Event handlers are not guaranteed to be run in the same thread where they were registered.
The asynchronous nature of the events requires the use of synchronization constructs on objects
and data structures that are not defined to be thread safe.
Microsoft's documentation about the lock statement: http://msdn.microsoft.com/en-us/library/c5kehkcz.aspx
Microsoft's documentation about delegates: http://msdn.microsoft.com/en-us/library/900fyy8e.aspx
Microsoft's documentation about managed threading: http://msdn.microsoft.com/en-us/library/1c9txz50.aspx
The following example shows how to make sure that only one selection event handler is running at a time.
using Tekla.Structures.Drawing;
using Tekla.Structures.Drawing.UI;
public class Example
{
private Tekla.Structures.Drawing.UI.Events _events = new Tekla.Structures.Drawing.UI.Events();
private object _selectionEventHandlerLock = new object();
public void RegisterEventHandler()
{
_events.SelectionChange += Events_SelectionChangeEvent;
_events.Register();
}
public void UnRegisterEventHandler()
{
_events.UnRegister();
}
void Events_SelectionChangeEvent()
{
/* Make sure that the inner code block is running synchronously */
lock(_selectionEventHandlerLock)
{
System.Console.WriteLine("Selection changed event received.");
}
}
}

Tekla.Structures.Drawing.UI.Events.SelectionChange
The SelectionChange event is raised when the selection is changed in a Tekla Structures drawing.

Tekla.Structures.Drawing.UI.Events.DrawingEditorOpened
The DrawingEditorOpened event is raised when the drawing editor is opened.

Tekla.Structures.Drawing.UI.Events.DrawingEditorClosed
The DrawingEditorClosed event is raised when the drawing editor is closed.

Tekla.Structures.Drawing.UI.Events.DrawingLoaded
The DrawingLoaded event is raised when a new drawing is opened in the drawing editor.

Tekla.Structures.Drawing.UI.Events.DrawingListSelectionChanged
The DrawingListSelectionChanged event is raised when selection on the drawing list has changed.
Remarks:
This event is also raised if a file is selected or deselected in Document Manager,
but no information about the selected file(s) is available.

Tekla.Structures.Drawing.UI.Events.DocumentManagerClosed
The DocumentManagerClosed eventis raised when the document manager is closed.

Tekla.Structures.Drawing.UI.Events.Interrupted
Occurs when user interrupts.

Tekla.Structures.Drawing.UI.Events.LayoutEditingModeEntered
The LayoutEditingModeEntered event is raised when layout editing mode is started.

Tekla.Structures.Drawing.UI.Events.LayoutEditingModeExited
The LayoutEditingModeEntered event is raised when layout editing mode is finished.

Tekla.Structures.Drawing.UI.Events.LayoutTableInserted
The event is raised when table is inserted

Tekla.Structures.Drawing.UI.Events.LayoutTableModified
The event is never raised

Tekla.Structures.Drawing.UI.Events.LayoutTableDeleted
The event is raised when table is deleted

Tekla.Structures.Drawing.UI.Events.LayoutTableLayoutModified
The event is raised when tablelayout is modified

Tekla.Structures.Drawing.UI.Events.LayoutOptionModified
The event is raised when layout option is modified

Tekla.Structures.Drawing.UI.Events.OnSelectionChange(System.String,System.Object[])


Tekla.Structures.Drawing.UI.Events.OnDrawingEditorOpen(System.String,System.Object[])


Tekla.Structures.Drawing.UI.Events.OnDrawingEditorClose(System.String,System.Object[])


Tekla.Structures.Drawing.UI.Events.OnDrawingLoaded(System.String,System.Object[])


Tekla.Structures.Drawing.UI.Events.OnDrawingListSelectionChanged(System.String,System.Object[])


Tekla.Structures.Drawing.UI.Events.OnDocumentManagerClosed(System.String,System.Object[])


Tekla.Structures.Drawing.UI.Events.OnLayoutEditingModeEntered(System.String,System.Object[])


Tekla.Structures.Drawing.UI.Events.OnLayoutEditingModeExited(System.String,System.Object[])


Tekla.Structures.Drawing.UI.Events.OnLayoutTableDeleted(System.String,System.Object[])


Tekla.Structures.Drawing.UI.Events.OnLayoutTableInserted(System.String,System.Object[])


Tekla.Structures.Drawing.UI.Events.OnLayoutTableModified(System.String,System.Object[])


Tekla.Structures.Drawing.UI.Events.OnLayoutTableLayoutModified(System.String,System.Object[])


Tekla.Structures.Drawing.UI.Events.OnLayoutOptionModified(System.String,System.Object[])


Tekla.Structures.Drawing.UI.Events.OnInterrupted
Called when uesr interrupts.

Tekla.Structures.Drawing.UI.Events.InitializeLifetimeService
Initializes the lifetime service.
Returns: Always null.

Tekla.Structures.Drawing.UI.Events.#ctor
Constructs a new instance of Events.

Tekla.Structures.Drawing.UI.Events.Register
Registers the instance to listen to the specified events.
Throws System.InvalidOperationException: Thrown if attempting registration when already registered.

Tekla.Structures.Drawing.UI.Events.UnRegister
Unregisters the instance from listening to events.

Tekla.Structures.Drawing.UI.Events.Dispose
Disposes of the Events instance.

Tekla.Structures.Drawing.UI.Events.Finalize
Finalizes the Events instance.